#-----------------------------------
# 元组的声明
#-----------------------------------

x = 1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
# 只需要将一些值用逗号分隔，就构成了一个元组
print(x)

x = (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
# 标准的元组生命方式
print(x)

x = (1, 2, 3, 'a', 'b', 'c')
# 元组是一种序列
print(x)

x = (1, 2, 4)
# 元组一旦声明， 就不能再被修改
# x[1] = 1001
# TypeError: 'tuple' object does not support item assignment
print(x)

x = (23,)
print(x)
print(type(x))
x = 23,
print(x)
print(type(x))
# 声明一个元素的元组， 必须在元素后面追加一个逗号
# 逗号至关重要， 是区分普通数据与元组的重要标志

x = ()
print(x)

x = 3 * (50 + 8, )
# 逗号标志着这是一个序列与数的相乘操作
print(x)

x = (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
# 元组也是序列， 元组符合序列的一般操作
print(x[2])
print(x[2:6])

x = tuple(['a', 'b', 'c'])
print(x)
x = tuple('国')
print(x)
# 函数tuple() 接受一个序列为参数， 返回一个元组
# 可以理解为元组版的list函数