#-----------------------------------
# 字典方法 浅拷贝
#-----------------------------------

x = {'师傅': '唐僧', '二徒弟': '八戒', '行李': ['袈裟', '禅杖']}
y = x.copy()
# 浅拷贝之后， 给副本赋新值, 原字典不变
y['二徒弟'] = '沙悟净'
print(x)
print(y)
# 浅拷贝之后， 修改副本的值，原字典也会改变
y['行李'].append('钵盂')
print(x)
print(y)


print()


x = {'师傅': '唐僧', '二徒弟': '八戒', '行李': ['袈裟', '禅杖']}
y = x
# 直接重新赋值 给副本赋新值， 原字典改变
y['二徒弟'] = '沙悟净'
print(x)
print(y)
# 直接重新赋值 修改副本的值， 原字典也改变
y['行李'].append('钵盂')
print(x)
print(y)

print()

import copy

x = {'师傅': '唐僧', '二徒弟': '八戒', '行李': ['袈裟', '禅杖']}
y = copy.deepcopy(x)
# 深拷贝 给副本赋新值， 原字典不变
y['二徒弟'] = '沙悟净'
print(x)
print(y)
# 深拷贝 修改副本的值， 原字典不变
y['行李'].append('钵盂')
print(x)
print(y)