#-----------------------------------
# 序列解包
#-----------------------------------

# 序列解包操作
# ----------------------------------

# 元组序列解包
a, b, c = '唐僧', '悟空', '八戒'
print(a, b, c)
(a, b, c) = ('唐僧', '悟空', '八戒')
print(a, b, c)

# 字符串序列解包
a, b, c = 'god'
print(a, b, c)

# 列表序列解包
a, b, c = ['唐僧', '悟空', '八戒']
print(a, b, c)

# 使用 * 号收集多余的值
a, b, *c = ['唐僧', '悟空', '八戒', '沙僧', '行李', '白龙马']
print(a, b, c)

print()
# 注意事项
# ----------------------------------

# 序列包数量多, 报错
# a, b, c = ['唐僧', '悟空', '八戒', '沙僧']
# ValueError: too many values to unpack (expected 3)

# 解包变量数多, 报错
# a, b, c, d = ['唐僧', '悟空', '八戒']
# ValueError: not enough values to unpack (expected 4, got 3)

# 序列解包用途
# ----------------------------------

# 并行赋值
a, b = '唐僧', '孙悟空'
print(a, b)

# 对调变量值
a, b, = b, a
print(a, b)

# 丢弃不用的变量值
a, b, *_ = '唐僧', '八戒', '行李', '沙僧'
print()